#include <iostream>

int main(){


                                        // Наслідування (Inheritance)

/*
    Наслідування - Один із основних принципів ООП

* Надає можливість створити нові класи на базі інсуючих
* Дозволяє перевикористання коду уникаючи його дублювання
* Надає можливість модифікувати поведінку існуючих класів у нових
* Буває Single inheritance or Multiple inheritance
*/

// [-]  1. Згадуємо інкапсуляцію.
/*
Інкапсуляція - це концепція ООП, яка дозволяє обʼєднувати дані та методи їх обробки в одну
єдину сутність, яка називається класом або строктурою і захищати їх від зовнішнього втручання
завдяки модифікаторам доступу(privat,protected).
*/

    return 0;
}